cf/BusinessProcesses/СогласованиеАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>СогласованиеАссортимента</Name>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Письмо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСогласование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласованиеАссортимента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановкаЦен</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСогласования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокИнициаторов</Name>
							<Comment>для печатной формы КП</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/InformationRegisters/ЗапросНаСогласованиеТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗапросНаСогласованиеТовара</Name>
			<Comment>Запрос на включение товара в согласованный ассортимент партнера ИПР</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оповещение</Name>
					<Comment>Письмо-оповещение, о том что заявка зарегистрирована в системе</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Письмо</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Письмо</Name>
					<Comment>Письмо о том, что запрос поступил на рассмотрение (пошел по нашему Бизнес-процессу)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Письмо</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСогласования</Name>
					<Comment>Документ, на основании которого было принято решение о согласовании запроса</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласованиеАссортимента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>1 - создан в 1с, 2 - отправлен на рассмотрение 3 - согласован, 4 - не согласован, 5 - все плохо</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиИнтернет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Comment>ID сайта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/ТипыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыТекстовЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмеченныйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/BusinessProcesses/СогласованиеАссортимента/Ext/ObjectModule.bsl
Процедура ПисьмоОтправленоПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = НЕ Письмо.Пустая();
КонецПроцедуры

Процедура ОтправитьПисьмоОбработка(ТочкаМаршрутаБизнесПроцесса)
	// запишем письмо в регистр
//	Менеджер = РегистрыСведений.ЗапросНаСогласованиеТовара;
	//Для Каждого Строка Из Партнеры Цикл
	//	Для Каждого Товар ИЗ Товары Цикл
	//		НаборЗаписей = Менеджер.СоздатьНаборЗаписей();
	//		НаборЗаписей.Отбор.Партнер.Установить(Строка.Партнер);
	//		НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Номенклатура);
	//		НаборЗаписей.Прочитать();
	//		Если НаборЗаписей.Выбран() Тогда
	//			Для Каждого Запись Из НаборЗаписей Цикл
	//				Запись.Письмо = Письмо;
	//				Запись.Статус = 2; КонецЦикла;  //отправлено на рассмотрение
	//				НаборЗаписей.Записать();
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЦикла;
	
КонецПроцедуры

Процедура ПисьмоРассмотрениеОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	// всем пользователям подавшим заявку на согласование шлем письма, что их товар ушел на рассмотрение
	
	Менеджер = РегистрыСведений.ЗапросНаСогласованиеТовара;

	Запрос = Новый Запрос("ВЫБРАТЬ Номенклатура, Номенклатура.Артикул Артикул, Партнер, Пользователь, ID, Период, Оповещение 
	| 
	|ИЗ	РегистрСведений.ЗапросНаСогласованиеТовара 
	| 
	|ГДЕ Номенклатура В (&Номенклатура) И Партнер В(&Партнеры) И Статус = 1
	|
	|ИТОГИ ПО Пользователь");
	
	Запрос.УстановитьПараметр("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Партнеры", Контрагенты.ВыгрузитьКолонку("Партнер"));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПолучатель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	URLИнтернетМагазин = Константы.ПутьИнтернетМагазин.Получить();
			
	Пока ВыборкаПолучатель.Следующий() Цикл
		
		НачатьТранзакцию();
		
		ТекстПисьмаТело = "<table>";
		
		Получатель = ВыборкаПолучатель.Пользователь;
		
		Если ТипЗнч(Получатель) = Тип("СправочникСсылка.ПользователиИнтернет") Тогда
			
			Кому = Получатель.ЭлектроннаяПочта;
			ТекстПисьмаЗаголовок = "Уважаемый(ая) " + Получатель + "!" + "<BR><BR> Запрос по согласованию перечисленных ниже позиций был отправлен на согласование в коммерческую службу. После того как запрос будет рассмотрен, мы пришлем Вам уведомление.:<BR>";	
			
		КонецЕсли;		
	 
		ВыборкаТовары = ВыборкаПолучатель.Выбрать();               
		 
		Пока ВыборкаТовары.Следующий() Цикл 
			
			////////ЗАПИСЬ В РЕГИСТР////////
			Запись =  Менеджер.СоздатьМенеджерЗаписи(); 
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаТовары);  
			Запись.Статус = 2; 
			Запись.Письмо = Письмо;
			
			Попытка
				Запись.Записать(Истина);
			Исключение
				ЗаписьЖурналаРегистрации("Данные.Запись", УровеньЖурналаРегистрации.Ошибка, , , 
				ОписаниеОшибки());
				ОтменитьТранзакцию();
				Возврат;
			КонецПопытки;
			///////////////////////////////
			
			Товар = ВыборкаТовары.Номенклатура;
			ТекстПисьмаТело = ТекстПисьмаТело + "<tr><td>" + Товар.Артикул + "</td><td><A style=""COLOR: rgb(0,0,204)"" href='http://" + URLИнтернетМагазин + "/tovar/" + НРег(Товар.alies) + "'>"+ Товар +"</A></td></tr>";
		КонецЦикла;

	   	ТемаПисьма = "Заявка на согласование товара поступила на рассмотрение в коммерческую службу"; 

		ТекстПисьма = ТекстПисьмаЗаголовок + ТекстПисьмаТело + "</table>" + КэшируемыеФункции.ПолучитьПодвалПисьма();
				
		ПисьмоПользователю = ОбщиеФункции.ОповеститьПоПочте(Кому, ТемаПисьма, ТекстПисьма, Ложь, Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
		
		Если ПисьмоПользователю = Неопределено Тогда
			ЗаписьЖурналаРегистрации("Данные.Запись", УровеньЖурналаРегистрации.Ошибка, , , 
				ОписаниеОшибки() + "
				|получатель = " + Получатель + "
				|товар = " + Товар);
				ОтменитьТранзакцию();
			
			Возврат; 
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;

КонецПроцедуры

Процедура ПисьмоРезультатОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	// ищем все открытые заявки (статус 1), или заявки ожидающие ответа (статус 2)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Тов.Номенклатура КАК Номенклатура, Тов.ДатаНачала КАК ДатаНачала, Тов.Согласовано Согласовано ПОМЕСТИТЬ Товары ИЗ &Номенклатура КАК Тов
	|;
	|
	|ВЫБРАТЬ Пользователь, Номенклатура, Номенклатура.Артикул Артикул, ИСТИНА Согласовано, ID, Партнер, Период, Оповещение, Письмо 
	|ИЗ РегистрСведений.ЗапросНаСогласованиеТовара 
	|ГДЕ Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ Товары ГДЕ Согласовано) И Партнер В (&Партнеры) И (Статус = 1 ИЛИ Статус = 2) 
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ Пользователь, Номенклатура, Номенклатура.Артикул Артикул, ЛОЖЬ Согласовано, ID, Партнер, Период, Оповещение, Письмо  
	|ИЗ РегистрСведений.ЗапросНаСогласованиеТовара 
	|ГДЕ Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ Товары ГДЕ НЕ Согласовано) И Партнер В (&Партнеры) И (Статус = 1 ИЛИ Статус = 2) 
	|
	|ИТОГИ ПО Пользователь, Согласовано");
	
	Запрос.УстановитьПараметр("Номенклатура", Товары.Выгрузить());
	Запрос.УстановитьПараметр("Партнеры", Контрагенты.Выгрузить().ВыгрузитьКолонку("Партнер"));

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПолучатель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	URLИнтернетМагазин = Константы.ПутьИнтернетМагазин.Получить();
	Менеджер = РегистрыСведений.ЗапросНаСогласованиеТовара;
	
	
	Пока ВыборкаПолучатель.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Получатель = ВыборкаПолучатель.Пользователь;
		
		Если ТипЗнч(Получатель) = Тип("СправочникСсылка.ПользователиИнтернет") Тогда
			
			Кому = Получатель.ЭлектроннаяПочта;
			ТекстПисьмаЗаголовок = "Уважаемый(ая) " + Получатель + "!" + "<BR><BR> Мы получили ответ от Вашей коммерческой службы по запрашиваемыми позициям и сообщаем Вам о результате.<BR>";	
		
		КонецЕсли;
		ТекстПисьмаТело = "";
		ВыборкаСогласовано = ВыборкаПолучатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока ВыборкаСогласовано.Следующий() Цикл
			
			ВыборкаТовары = ВыборкаСогласовано.Выбрать();               
			ТекстПисьмаТело = ТекстПисьмаТело + ?(ВыборкаТовары.Количество(), ?(ВыборкаСогласовано.Согласовано, "<BR> Следующие позиции были согласованы: <BR>","<BR> Следующие позиции были отклонены: <BR>"),"")  +"<table>";
			
			Пока ВыборкаТовары.Следующий() Цикл Товар = ВыборкаТовары.Номенклатура;
				
				
				//////////////ЗАПИСЬ В РЕГИСТР//////////////
				Запись = Менеджер.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаТовары);
				Запись.ДокументСогласования = ?(ВыборкаСогласовано.Согласовано, ДокументСогласование, Неопределено);
				Запись.Статус = ?(ВыборкаСогласовано.Согласовано, 3, 4); 
				Попытка
					Запись.Записать();
				Исключение
					ЗаписьЖурналаРегистрации("Данные.Запись", УровеньЖурналаРегистрации.Ошибка, , , 
					ОписаниеОшибки());
					ОтменитьТранзакцию();
					Возврат;
				КонецПопытки;
				/////////////////////////////////////////////	
				
				ТекстПисьмаТело = ТекстПисьмаТело + "<tr><td>" + Товар.Артикул + "</td><td><A style=""COLOR: rgb(0,0,204)"" href='http://" + URLИнтернетМагазин + "/tovar/" + НРег(Товар.alies) + "'>"+ Товар +"</A></td></tr>";
			КонецЦикла;
		
			ТекстПисьмаТело = ТекстПисьмаТело + "</table>"; 
		КонецЦикла;
		
	   	ТемаПисьма = "Заявка на согласование товара рассмотрена коммерческой службой"; 

		ТекстПисьма = ТекстПисьмаЗаголовок + ТекстПисьмаТело + КэшируемыеФункции.ПолучитьПодвалПисьма();
		
		ПисьмоПользователю = ОбщиеФункции.ОповеститьПоПочте(Кому, ТемаПисьма, ТекстПисьма, Ложь, Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
		
		Если ПисьмоПользователю = Неопределено Тогда
			ЗаписьЖурналаРегистрации("Данные.Запись", УровеньЖурналаРегистрации.Ошибка, , , 
				ОписаниеОшибки() + "
				|получатель = " + Получатель + "
				|товар = " + Товар);
			ОтменитьТранзакцию();
			Возврат; 
		КонецЕсли;
			
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;

КонецПроцедуры


Процедура ПодтвердитьСогласованиеПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)

	Для Каждого Строка ИЗ Товары Цикл
		
		Если Строка.ДатаНачала = '00010101' Тогда
			Отказ = Истина;
			Сообщить("Значенеи поля ""ДатаНачала"" не должно быть пустым");
			Возврат;
		КонецЕсли;
		
	КонецЦикла
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Пользователь, Номенклатура ИЗ РегистрСведений.ЗапросНаСогласованиеТовара ГДЕ Номенклатура В (&Номенклатура) И Партнер В (&Партнеры) И (Статус = 1 ИЛИ (Статус = 2 И Письмо = &Письмо)) ИТОГИ ПО Номенклатура");
	Запрос.УстановитьПараметр("Письмо", Письмо);
	Запрос.УстановитьПараметр("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Партнеры", Контрагенты.ВыгрузитьКолонку("Партнер"));
	ВыборкаТовары = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Пока ВыборкаТовары.Следующий() Цикл стрИнициаторы = "";
		
		СтрокиТовара = Товары.НайтиСтроки(Новый Структура("Номенклатура", ВыборкаТовары.Номенклатура));
		Выборка = ВыборкаТовары.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			стрИнициаторы  = стрИнициаторы + ", " + Выборка.Пользователь;
		КонецЦикла;
		
		Для Каждого Строка ИЗ СтрокиТовара Цикл
			Строка.СписокИнициаторов = Сред(стрИнициаторы, 2);
		КонецЦикла;
		
	КонецЦикла;
КонецПроцедуры


Процедура ОформитьЗаявкуНаСогласованиеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
КонецПроцедуры
